package test;

public class TotalTestQuestion {

	public static void main(String[] args) {

//		1번 문제
//		답 : 잘 정의된 약속된 구조나 골격.
		
//		2번 문제
//		답 : 잘 정의된 약속된 구조의 클래스 틀
		
//		3번 문제
//		답 : 데이터의 저장과 관련이 있는 학문으로서, 검색 등 다양한 측면을
//			고려하여 효율적인 데이터의 저장 방법을 연구하는 학문.
		
//		4번 문제
//		답 : 저장된 데이터의 일부 또는 전체를 대상으로 진행하는 각종
//			연산을 연구하는 학문.
		
//		5번 문제
//		답 : 배열,리스트,스택,큐,트리,해시 등
		
//		6번 문제
//		답 : 정렬,탐색,최대,최소,검색
		
//		7번 문제
//		답 : 데이터의 저장, 그리고 이와 관련 있는 알고리즘을 구조화 해 놓은
//			프레임워크
		
//		9번 문제
//		답 : 인터페이스 구조를 기반으로 클래스들이 정의되어 있기 때문
		
//		10번 문제
//		답 : ArrayList<E>,LinkedList<E>
		
//		11번 문제
//		답 : 동일한 인스턴스의 중복저장을 허용한다.
//			인스턴스의 저장 순서가 유지된다.
		
		
	}

}
